
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	// Очистка старых движений
	Движения.ОстаткиТоваров.Записать();
	Движения.Продажи.Записать();
	
	// Установка блокировки для регистра накопления остатков ОстаткиТоваров
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");
	Блокировка.Заблокировать();
	
	// Получение данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Товар КАК Товар,
		|	СУММА(РеализацияТовары.Количество) КАК КоличествоДок,
		|	СУММА(РеализацияТовары.Сумма) КАК СуммаДок
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Товар КАК Товар,
		|	ВТТовары.Товар.Представление КАК ТоварПредставление,
		|	ВТТовары.КоличествоДок КАК КоличествоДок,
		|	ВТТовары.СуммаДок КАК СуммаДок,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.СебестоимостьОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&МоментВремени,
		|				Товар В
		|					(ВЫБРАТЬ
		|						ВТТовары.Товар КАК Товар
		|					ИЗ
		|						ВТТовары КАК ВТТовары)) КАК ОстаткиТоваровОстатки
		|		ПО ВТТовары.Товар = ОстаткиТоваровОстатки.Товар";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Контроль остатков
		Если Выборка.КоличествоДок > Выборка.КоличествоОстаток Тогда
			Нехватка = Выборка.КоличествоДок - Выборка.КоличествоОстаток;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает товара """ + Выборка.ТоварПредставление + """ в количестве " + Нехватка + " шт.";
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;

		// Расчёт списываемой себестоимости
		Если Выборка.КоличествоДок = Выборка.КоличествоОстаток Тогда
			Себестоимость = Выборка.СуммаОстаток;
		Иначе
			Себестоимость = Выборка.КоличествоДок / Выборка.КоличествоОстаток * Выборка.СуммаОстаток;
		КонецЕсли;
		
		// Движение по регистру ОстаткиТоваров
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.КоличествоДок;
		Движение.Себестоимость = Себестоимость;
		
		// Движение по регистру Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.КоличествоДок;
		Движение.Себестоимость = Себестоимость;
		Движение.Продажа = Выборка.СуммаДок;
		
	КонецЦикла;
	
КонецПроцедуры
