
&НаСервереБезКонтекста
Процедура ЗарегистрироватьИзмененияНаСервере(Узел)
	// Регистрация изменений всех данных для узла
	ПланыОбмена.ЗарегистрироватьИзменения(Узел);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПредопределенныйУзел(Узел)
	Возврат Узел = ПланыОбмена.Филиалы.ЭтотУзел();
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	ЗарегистрироватьИзмененияНаСервере(Элементы.Список.ТекущаяСтрока);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Изменения зарегистрированы!";
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ЭтоПредопределенныйУзел(Элемент.ТекущаяСтрока) Тогда
		Элементы.ФормаЗарегистрироватьИзменения.Доступность = Ложь;
	Иначе
		Элементы.ФормаЗарегистрироватьИзменения.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

