
Процедура РассчитатьНачисления(НаборЗаписейРегистра, ТребуемыйВидРасчета, СписокСотрудников) Экспорт
	
	Регистратор = НаборЗаписейРегистра.Отбор.Регистратор.Значение;
	
	Если ТребуемыйВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
		
		// Рассчитать первичные записи
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма,
			|	НачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
			|	НачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	РегистрРасчета.Начисления.ДанныеГрафика(
			|			Регистратор = &Регистратор
			|				И ВидРасчета = &ВидРасчета
			|				И Сотрудник В (&СписокСотрудников)) КАК НачисленияДанныеГрафика";
		
		Запрос.УстановитьПараметр("ВидРасчета", ТребуемыйВидРасчета);
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Для Каждого ЗаписьРегистра Из НаборЗаписейРегистра Цикл
			
			СтруктураНомер = Новый Структура("НомерСтроки", ЗаписьРегистра.НомерСтроки);
			Выборка.Сбросить();
			
			Если Выборка.НайтиСледующий(СтруктураНомер) Тогда
				
				Если Выборка.Норма = 0 Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Вид расчета: Оклад – Нет рабочих дней в заданном периоде";
					Сообщение.Сообщить();
					ЗаписьРегистра.Результат = 0;
				Иначе
					// Рассчитать оклад по фактическому периоду и исходным данным
					Результат = (ЗаписьРегистра.ИсходныеДанные / Выборка.Норма) * Выборка.Факт;
					ЗаписьРегистра.Результат = Результат;
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Выполнен расчет " + ЗаписьРегистра.Регистратор + "_" +
									  ЗаписьРегистра.ВидРасчета + "_" +
									  ЗаписьРегистра.Сотрудник;
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	ИначеЕсли ТребуемыйВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
		
		// Рассчитать вторичные записи
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачисленияБазаНачисления.РезультатБаза КАК База,
			|	НачисленияБазаНачисления.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	РегистрРасчета.Начисления.БазаНачисления(
			|			&ИзмеренияОсновного,
			|			&ИзмеренияБазового,
			|			,
			|			Регистратор = &Регистратор
			|				И ВидРасчета = &ВидРасчета
			|				И Сотрудник В (&СписокСотрудников)) КАК НачисленияБазаНачисления";

		Измер = Новый Массив(1);
		Измер[0] = "Сотрудник";
		
		Запрос.УстановитьПараметр("ВидРасчета", ТребуемыйВидРасчета);
		Запрос.УстановитьПараметр("ИзмеренияБазового", Измер);
		Запрос.УстановитьПараметр("ИзмеренияОсновного", Измер);
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);

		Выборка = Запрос.Выполнить().Выбрать();

		Для Каждого ЗаписьРегистра Из НаборЗаписейРегистра Цикл
			
			СтруктураНомер = Новый Структура("НомерСтроки", ЗаписьРегистра.НомерСтроки);
			Выборка.Сбросить();
			
			Если Выборка.НайтиСледующий(СтруктураНомер) Тогда
				
				// Премия = Оклад * 10%
				ЗаписьРегистра.Результат = Выборка.База * (10 / 100);
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Выполнен расчет" +
								  ЗаписьРегистра.Регистратор + "_" +
								  ЗаписьРегистра.ВидРасчета  + "_" +
								  ЗаписьРегистра.Сотрудник;
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерерассчитатьНачисления(ТребуемыйВидРасчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Перерасчет.ОбъектПерерасчета КАК ОбъектПерерасчета,
		|	Перерасчет.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрРасчета.Начисления.Перерасчет КАК Перерасчет
		|ГДЕ
		|	Перерасчет.ВидРасчета = &ТребуемыйВидРасчета
		|ИТОГИ ПО
		|	ОбъектПерерасчета";
	
	Запрос.УстановитьПараметр("ТребуемыйВидРасчета", ТребуемыйВидРасчета);
	СписокСотрудников = Новый СписокЗначений;
	
	// Перебрать группировку по регистратору
	ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() Цикл 
		
		Регистратор = ВыборкаРегистратор.ОбъектПерерасчета;
		
		// Перебрать группировку по сотрудникам для выбранного регистратора
		// и создать список сотрудников
		ВыборкаСотрудники = ВыборкаРегистратор.Выбрать();
		СписокСотрудников.Очистить();
		Пока ВыборкаСотрудники.Следующий() Цикл 
			СписокСотрудников.Добавить(ВыборкаСотрудники.Сотрудник);
		КонецЦикла;
		
		// Получит набор записей регистра расчета для выбранного регистратора
		НаборЗаписей = РегистрыРасчета.Начисления.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = Регистратор;
		НаборЗаписей.Прочитать();
		
		РассчитатьНачисления(
			НаборЗаписей,
			ТребуемыйВидРасчета,
			СписокСотрудников);
		НаборЗаписей.Записать(, Истина);	
		
		// Очистить перерассчитанные записи в перерасчете
		НаборЗаписейПерерасчета = РегистрыРасчета.Начисления.Перерасчеты.Перерасчет.СоздатьНаборЗаписей();
		НаборЗаписейПерерасчета.Отбор.ОбъектПерерасчета.Значение = Регистратор;
		НаборЗаписейПерерасчета.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

