
Процедура ЗаполнитьГрафик(ВидГрафикаРаботы) Экспорт
	
	ТекДень = НачалоГода(ТекущаяДата());
	ПоследнийДень = КонецГода(ТекущаяДата());
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	//НаборЗаписей.Записывать = Истина;
	
	Пока ТекДень < ПоследнийДень Цикл
		ЭтоРабочийДень = ?(ДеньНедели(ТекДень) < 6, 1, 0);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ГрафикРаботы = ВидГрафикаРаботы;
		НоваяЗапись.Дата = ТекДень;
		НоваяЗапись.Значение = ЭтоРабочийДень;
		
		ТекДень = ТекДень + 60*60*24; // Прибавляем один день к дате	
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
	
КонецПроцедуры