
Процедура ОбновлениеИндекса() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СлияниеИндексов() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеКурсовВалют() Экспорт
	
	// Получаем список валют, используемых в нашей конфигурации
	СписокВалют = РаботаСВалютой.ПолучитьСписокВалют();
	
	// Получаем актуальные курсы валют из веб-сервиса Центробанка РФ
	КурсыВалют = РаботаСВалютой.ПолучитьАктуальныеКурсыВалют();
	
	Если КурсыВалют = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Записываем актуальные курсы валют в регистр сведений
	НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
	Дата = ТекущаяДата();
	
	Для Каждого КурсВалюты из КурсыВалют Цикл
		
		КодВалютыСтрока = СокрЛП(КурсВалюты.VchCode);
		
		Для Каждого Валюта Из СписокВалют Цикл
			
			Если Валюта.Код = КодВалютыСтрока Тогда
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = Дата;
				НоваяЗапись.Валюта = Валюта.Ссылка;
				НоваяЗапись.Курс = КурсВалюты.Vcurs;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

