
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

    // Если ИменаПараметровСеанса = Неопределено, значит идет запуск системы
    // Если содержит массив имен, значит произошло обращение к неустановленному параметру
    
    Если ТребуемыеПараметры <> Неопределено Тогда
        Для Каждого ИмяПараметра Из ТребуемыеПараметры Цикл
            Если ИмяПараметра = "ТекущийСклад" Тогда
				Пользователь = Справочники.Сотрудники.НайтиПоНаименованию(ПолноеИмяПользователя());
                ПараметрыСеанса.ТекущийСклад = Пользователь.РабочийОбъект; 
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
	
КонецПроцедуры
