
Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "ПриОтправкеДанныхГлавному " + ЭлементДанных;
	Сообщение.Сообщить();
	
КонецПроцедуры


Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "ПриОтправкеДанныхПодчиненному " + ЭлементДанных;
	Сообщение.Сообщить();
	
КонецПроцедуры


Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "ПриПолученииДанныхОтГлавного " + ЭлементДанных;
	Сообщение.Сообщить();
	
КонецПроцедуры


Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "ПриПолученииДанныхОтПодчиненного " + ЭлементДанных;
	Сообщение.Сообщить();
	
КонецПроцедуры

