
&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ОбработкаВыбораВидаГрафика", ЭтотОбъект);	
	ОткрытьФорму("Справочник.ВидыГрафиковРаботы.ФормаВыбора",, ЭтаФорма,,,, ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВидаГрафика(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ЗаполнитьГрафикНаСервере(ВыбранноеЗначение);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикНаСервере(ВидГрафикаРаботы)
	РегистрыСведений.ГрафикиРаботы.ЗаполнитьГрафик(ВидГрафикаРаботы);
КонецПроцедуры